In [1]:
# pip install mysqlclient
# pip install mysql-python
# pip uninstall sqlalchemy==1.4 -y && pip install sqlalchemy==1.3.24
# pip install ipython-sql
# pip install mysql-connector-python

In [2]:
%load_ext sql

In [3]:
# %sql mysql://username:password@hostname:port/database_name
%sql mysql://root:05111987Olg@@localhost:3306/mysql

In [4]:
%sql SHOW DATABASES

 * mysql://root:***@localhost:3306/mysql
8 rows affected.

[('cs50',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]

In [ ]:
%sql SHOW TABLES

Вот шаблон для различных вариантов работы с двумя таблицами в SQL:

1. Выборка всех строк из двух таблиц:

`SELECT *`

`FROM table1`

`JOIN table2 ON table1.id = table2.id;`



2. Выборка определенных колонок из двух таблиц:

`SELECT table1.column1, table2.column2`

`FROM table1`

`JOIN table2 ON table1.id = table2.id;`


3. Выборка с фильтрацией на основе условия:

`SELECT *`

`FROM table1`

`JOIN table2 ON table1.id = table2.id`

`WHERE table1.column1 = 'value';`


4. Выборка со сортировкой:

`SELECT *`

`FROM table1`

`JOIN table2 ON table1.id = table2.id`

`ORDER BY table1.column1 ASC;`


5. Вставка данных в две таблицы:

`INSERT INTO table1 (column1, column2)`

`VALUES ('value1', 'value2');`

`INSERT INTO table2 (column3, column4)`

`VALUES ('value3', 'value4');`


6. Обновление данных в двух таблицах:

`UPDATE table1`

`JOIN table2 ON table1.id = table2.id`

`SET table1.column1 = 'new_value1', table2.column2 = 'new_value2'`

`WHERE table1.id = 1;`


7. Удаление данных из двух таблиц:

`DELETE FROM table1`

`USING table1`

`JOIN table2 ON table1.id = table2.id`

`WHERE table1.id = 1;`

UNION

`SELECT column1, column2`
`FROM table1`
`WHERE condition`
`UNION`
`SELECT column3, column4`
`FROM table2`
`WHERE condition;`


В этом шаблоне column1, column2, column3, column4 - это столбцы, которые вы хотите выбрать из таблиц table1 и table2. condition - это условие, которое определяет, какие строки будут выбраны из каждой таблицы.

Оператор UNION объединяет результаты двух или более SELECT-запросов в один набор результатов и удаляет дублирующиеся строки.

Обратите внимание, что количество и тип столбцов, выбранных из каждой таблицы, должны совпадать, чтобы использовать оператор UNION. Если столбцы в таблицах различаются по типу или количеству, необходимо выполнить соответствующие преобразования данных или использовать операторы UNION ALL, которые сохраняют все строки, включая возможные дубликаты.

Не забудьте заменить table1, table2, column1, column2, column3, column4 и condition на соответствующие значения в вашем конкретном случае.

1. Левое объединение (LEFT JOIN):

SELECT *
FROM table1
LEFT JOIN table2 ON table1.id = table2.id;


Левое объединение (LEFT JOIN) возвращает все строки из левой таблицы (table1), а также соответствующие значения из правой таблицы (table2). Если нет соответствующих значений в правой таблице, то значения будут NULL.


2. Правое объединение (RIGHT JOIN):

SELECT *
FROM table1
RIGHT JOIN table2 ON table1.id = table2.id;


Правое объединение (RIGHT JOIN) возвращает все строки из правой таблицы (table2), а также соответствующие значения из левой таблицы (table1). Если нет соответствующих значений в левой таблице, то значения будут NULL.

3. Полное объединение (FULL JOIN):
SELECT *
FROM table1
FULL JOIN table2 ON table1.id = table2.id;

Полное объединение (FULL JOIN) возвращает все строки из обеих таблиц (table1 и table2) и заполняет отсутствующие значения NULL, если соответствующих значений нет в одной из таблиц.

В этих шаблонах table1 и table2 - это названия таблиц, которые вы объединяете, а id - это столбец, по которому происходит объединение.

In [7]:
%%sql 
DROP DATABASE IF EXISTS lesson_4;
CREATE DATABASE lesson_4;
USE lesson_4;
DROP TABLE IF EXISTS teacher;
CREATE TABLE teacher
(	
	id INT NOT NULL PRIMARY KEY,
    surname VARCHAR(45),
    salary INT
);

INSERT teacher
VALUES
	(1,"Авдеев", 17000),
    (2,"Гущенко",27000),
    (3,"Пчелкин",32000),
    (4,"Питошин",15000),
    (5,"Вебов",45000),
    (6,"Шарпов",30000),
    (7,"Шарпов",40000),
    (8,"Питошин",30000);
    
SELECT * from teacher; 
DROP TABLE IF EXISTS lesson;
CREATE TABLE lesson
(	
	id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    course VARCHAR(45),
    teacher_id INT,
    FOREIGN KEY (teacher_id)  REFERENCES teacher(id)
);
INSERT INTO lesson(course,teacher_id)
VALUES
	("Знакомство с веб-технологиями",1),
    ("Знакомство с веб-технологиями",2),
    ("Знакомство с языками программирования",3),
    ("Базы данных и SQL",4),
    ("Нейронные сети", NULL); -- Учитель, который ведет данный предмет, временно отстутствует

 * mysql://root:***@localhost:3306/mysql
0 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
8 rows affected.
8 rows affected.
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [8]:
%%sql  -- Создание таблицы с товарами
   CREATE TABLE products (
     product_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
     category INT NULL,
     product_name VARCHAR(100) NOT NULL
   );

   -- Создание таблицы с категориями
   CREATE TABLE categories (
     category_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
     category_name VARCHAR(100) NOT NULL
   );

   -- Добавление данных в таблицу с товарами
   INSERT INTO products(category, product_name)
     VALUES (1, 'Системный блок'),
            (1, 'Монитор'),
            (2, 'Холодильник'),
            (2, 'Телевизор'),
            (NULL, 'Операционная система');

   -- Добавление данных в таблицу с категориями
   INSERT INTO categories (category_name)
     VALUES ('Комплектующие компьютера'),
            ('Бытовая техника'),
            ('Мобильные устройства');

   SELECT * FROM products;
   SELECT * FROM categories;

 * mysql://root:***@localhost:3306/mysql
0 rows affected.
0 rows affected.
5 rows affected.
3 rows affected.
5 rows affected.
3 rows affected.

[(1, 'Комплектующие компьютера'),
 (2, 'Бытовая техника'),
 (3, 'Мобильные устройства')]

In [ ]:
%%sql
create table users
(
    id  int auto_increment primary key,
    login varchar(255) null,
    pass  varchar(255) null,
    male  tinyint      null
);

create table clients
(
    id    int auto_increment primary key,
    login varchar(255) null,
    pass  varchar(255) null,
    male  tinyint      null
);

INSERT INTO users (login, pass, male) VALUES ('alex', '$2y$10$6SzbBCMENklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH14y', 1);
INSERT INTO users (login, pass, male) VALUES ('Mikle', '$ws$10$6SzbBCMENklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH14y', 1);
INSERT INTO users (login, pass, male) VALUES ('Olia', '$2y$10$88zbBCKLJklStIgTqBKIluijJUnbeZ5WqJI4RJgkksnFZon5kH14y', 2);
INSERT INTO users (login, pass, male) VALUES ('Tom', '$2y$20$6SzbBCNRNklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH20y', 1);
INSERT INTO users (login, pass, male) VALUES ('Margaret', '$2y$20$6SzbBCNRNklStIgTqBKIluijJUnbeZ4wqIu4RJgkksnFZon5kH20y', 2);
INSERT INTO users (login, pass, male) VALUES ('alex', '$2y$10$6SzbBCMENklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH14y', 1);

INSERT INTO clients (login, pass, male) VALUES ('alexander', '$2y$10$6SzbBCMENklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH14y', 1);
INSERT INTO clients (login, pass, male) VALUES ('Mikle', '$ws$10$6SzbBCMENklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH14y', 1);
INSERT INTO clients (login, pass, male) VALUES ('Olia', '$2y$10$88zbBCKLJklStIgTqBKIluijJUnbeZ5WqJI4RJgkksnFZon5kH14y', 2);
INSERT INTO clients (login, pass, male) VALUES ('Dmitry', '$2y$20$6SzbBCNRNklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH20y', 1);
INSERT INTO clients (login, pass, male) VALUES ('Margaret', '$2y$20$6SzbBCNRNklStIgTqBKIluijJUnbeZ4wqIu4RJgkksnFZon5kH20y', 2);
INSERT INTO clients (login, pass, male) VALUES ('Leonid', '$2y$10$6SzbBCMENklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH14y', 1);
INSERT INTO clients (login, pass, male) VALUES ('Mikle', '$ws$10$6SzbBCMENklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH14y', 1);
INSERT INTO clients (login, pass, male) VALUES ('Olga', '$2y$10$88zbBCKLJklStIgTqBKIluijJUnbeZ5WqJI4RJgkksnFZon5kH14y', 2);
INSERT INTO clients (login, pass, male) VALUES ('Tom', '$2y$20$6SzbBCNRNklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH20y', 1);
INSERT INTO clients (login, pass, male) VALUES ('Masha', '$2y$20$6SzbBCNRNklStIgTqBKIluijJUnbeZ4wqIu4RJgkksnFZon5kH20y', 2);
INSERT INTO clients (login, pass, male) VALUES ('alex', '$2y$10$6SzbBCMENklStIgTqBKIluijJUnbeZ5WqIu4RJgkksnFZon5kH14y', 1);


-- Задание на EXISTS
CREATE TABLE Employee (
  Id INT PRIMARY KEY,
  Name VARCHAR(45) NOT NULL,
  Department VARCHAR(45) NOT NULL,
  Salary FLOAT NOT NULL,
  Gender VARCHAR(45) NOT NULL,
  Age INT NOT NULL,
  City VARCHAR(45) NOT NULL
);
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1001, 'John Doe', 'IT', 35000, 'Male', 25, 'London');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1002, 'Mary Smith', 'HR', 45000, 'Female', 27, 'London');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1003, 'James Brown', 'Finance', 50000, 'Male', 28, 'London');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1004, 'Mike Walker', 'Finance', 50000, 'Male', 28, 'London');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1005, 'Linda Jones', 'HR', 75000, 'Female', 26, 'London');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1006, 'Anurag Mohanty', 'IT', 35000, 'Male', 25, 'Mumbai');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1007, 'Priyanla Dewangan', 'HR', 45000, 'Female', 27, 'Mumbai');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1008, 'Sambit Mohanty', 'IT', 50000, 'Male', 28, 'Mumbai');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1009, 'Pranaya Kumar', 'IT', 50000, 'Male', 28, 'Mumbai');
INSERT INTO Employee (Id, Name, Department, Salary, Gender, Age, City) VALUES (1010, 'Hina Sharma', 'HR', 75000, 'Female', 26, 'Mumbai');
CREATE TABLE Projects (
 ProjectId INT PRIMARY KEY AUTO_INCREMENT,
      Title VARCHAR(200) NOT NULL,
     ClientId INT,
 EmployeeId INT,
     StartDate DATETIME,
     EndDate DATETIME
);
INSERT INTO Projects ( Title, ClientId, EmployeeId, StartDate, EndDate) VALUES 
('Develop ecommerse website from scratch', 1, 1003, NOW(), DATE_ADD(NOW(), INTERVAL 30 DAY)),
('WordPress website for our company', 1, 1002, NOW(), DATE_ADD(NOW(), INTERVAL 45 DAY)),
('Manage our company servers', 2, 1007, NOW(), DATE_ADD(NOW(), INTERVAL 45 DAY)),
('Hosting account is not working', 3, 1009, NOW(), DATE_ADD(NOW(), INTERVAL 7 DAY)),
('MySQL database from my desktop application', 4, 1010, NOW(), DATE_ADD(NOW(), INTERVAL 15 DAY)),
('Develop new WordPress plugin for my business website', 2, NULL, NOW(), DATE_ADD(NOW(), INTERVAL 10 DAY)),
('Migrate web application and database to new server', 2, NULL, NOW(), DATE_ADD(NOW(), INTERVAL 5 DAY)),
('Android Application development', 4, 1004, NOW(), DATE_ADD(NOW(), INTERVAL 30 DAY));

-- Собеседования
CREATE TABLE  AUTO 
(       
	REGNUM VARCHAR(10) PRIMARY KEY, 
	MARK VARCHAR(10), 
	COLOR VARCHAR(15),
	RELEASEDT DATE, 
	PHONENUM VARCHAR(15)
);


CREATE TABLE  CITY 
(	
    CITYCODE INT PRIMARY KEY,
	CITYNAME VARCHAR(50), 
	PEOPLES INT 
);


CREATE TABLE  MAN 
(	
	PHONENUM VARCHAR(15) PRIMARY KEY , 
	FIRSTNAME VARCHAR(50),
	LASTNAME VARCHAR(50),  
	CITYCODE INT, 
	YEAROLD INT	 
);


-- AUTO
INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111114,'LADA', 'КРАСНЫЙ', date'2008-01-01', '9152222221');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111115,'VOLVO', 'КРАСНЫЙ', date'2013-01-01', '9173333334');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111116,'BMW', 'СИНИЙ', date'2015-01-01', '9173333334');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111121,'AUDI', 'СИНИЙ', date'2009-01-01', '9173333332');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111122,'AUDI', 'СИНИЙ', date'2011-01-01', '9213333336');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111113,'BMW', 'ЗЕЛЕНЫЙ', date'2007-01-01', '9214444444');


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111126,'LADA', 'ЗЕЛЕНЫЙ', date'2005-01-01', null);


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111117,'BMW', 'СИНИЙ', date'2005-01-01', null);


INSERT INTO AUTO (REGNUM, MARK,	COLOR, RELEASEDT, PHONENUM )
VALUES(111119,'LADA', 'СИНИЙ', date'2017-01-01', 9213333331);


-- CITY
INSERT INTO CITY (CITYCODE,CITYNAME,PEOPLES)
VALUES(1,'Москва', 10000000);


INSERT INTO CITY (CITYCODE,CITYNAME,PEOPLES)
VALUES(2,'Владимир', 500000);


INSERT INTO CITY (CITYCODE,CITYNAME,PEOPLES)
VALUES(3, 'Орел', 300000);


INSERT INTO CITY (CITYCODE,CITYNAME,PEOPLES)
VALUES(4,'Курск', 200000);


INSERT INTO CITY (CITYCODE,CITYNAME,PEOPLES)
VALUES(5, 'Казань', 2000000);


INSERT INTO CITY (CITYCODE,CITYNAME,PEOPLES)
VALUES(7, 'Котлас', 110000);


INSERT INTO CITY (CITYCODE,CITYNAME,PEOPLES)
VALUES(8, 'Мурманск', 400000);


INSERT INTO CITY (CITYCODE,CITYNAME,PEOPLES)
VALUES(9, 'Ярославль', 500000);

-- MAN
INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9152222221','Андрей','Николаев', 1, 22);


INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9152222222','Максим','Москитов', 1, 31);


INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9153333333','Олег','Денисов', 3, 34);


INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9173333334','Алиса','Никина', 4, 31);


INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9173333335','Таня','Иванова', 4, 31);


INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9213333336','Алексей','Иванов', 7, 25);


INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9213333331','Андрей','Некрасов', 2, 27);


INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9213333332','Миша','Рогозин', 2, 21);


INSERT INTO MAN (PHONENUM,FIRSTNAME,LASTNAME,CITYCODE,YEAROLD)
VALUES('9214444444','Алексей','Галкин', 1, 38);

In [10]:
%sql select * from Employee

 * mysql://root:***@localhost:3306/mysql
10 rows affected.

[(1001, 'John Doe', 'IT', 35000.0, 'Male', 25, 'London'),
 (1002, 'Mary Smith', 'HR', 45000.0, 'Female', 27, 'London'),
 (1003, 'James Brown', 'Finance', 50000.0, 'Male', 28, 'London'),
 (1004, 'Mike Walker', 'Finance', 50000.0, 'Male', 28, 'London'),
 (1005, 'Linda Jones', 'HR', 75000.0, 'Female', 26, 'London'),
 (1006, 'Anurag Mohanty', 'IT', 35000.0, 'Male', 25, 'Mumbai'),
 (1007, 'Priyanla Dewangan', 'HR', 45000.0, 'Female', 27, 'Mumbai'),
 (1008, 'Sambit Mohanty', 'IT', 50000.0, 'Male', 28, 'Mumbai'),
 (1009, 'Pranaya Kumar', 'IT', 50000.0, 'Male', 28, 'Mumbai'),
 (1010, 'Hina Sharma', 'HR', 75000.0, 'Female', 26, 'Mumbai')]

In [11]:
%sql select * from man

 * mysql://root:***@localhost:3306/mysql
9 rows affected.

[('9152222221', 'Андрей', 'Николаев', 1, 22),
 ('9152222222', 'Максим', 'Москитов', 1, 31),
 ('9153333333', 'Олег', 'Денисов', 3, 34),
 ('9173333334', 'Алиса', 'Никина', 4, 31),
 ('9173333335', 'Таня', 'Иванова', 4, 31),
 ('9213333331', 'Андрей', 'Некрасов', 2, 27),
 ('9213333332', 'Миша', 'Рогозин', 2, 21),
 ('9213333336', 'Алексей', 'Иванов', 7, 25),
 ('9214444444', 'Алексей', 'Галкин', 1, 38)]

In [12]:
%sql select * from city

 * mysql://root:***@localhost:3306/mysql
8 rows affected.

[(1, 'Москва', 10000000),
 (2, 'Владимир', 500000),
 (3, 'Орел', 300000),
 (4, 'Курск', 200000),
 (5, 'Казань', 2000000),
 (7, 'Котлас', 110000),
 (8, 'Мурманск', 400000),
 (9, 'Ярославль', 500000)]

In [13]:
%sql select * from AUTO

 * mysql://root:***@localhost:3306/mysql
9 rows affected.

[('111113', 'BMW', 'ЗЕЛЕНЫЙ', datetime.date(2007, 1, 1), '9214444444'),
 ('111114', 'LADA', 'КРАСНЫЙ', datetime.date(2008, 1, 1), '9152222221'),
 ('111115', 'VOLVO', 'КРАСНЫЙ', datetime.date(2013, 1, 1), '9173333334'),
 ('111116', 'BMW', 'СИНИЙ', datetime.date(2015, 1, 1), '9173333334'),
 ('111117', 'BMW', 'СИНИЙ', datetime.date(2005, 1, 1), None),
 ('111119', 'LADA', 'СИНИЙ', datetime.date(2017, 1, 1), '9213333331'),
 ('111121', 'AUDI', 'СИНИЙ', datetime.date(2009, 1, 1), '9173333332'),
 ('111122', 'AUDI', 'СИНИЙ', datetime.date(2011, 1, 1), '9213333336'),
 ('111126', 'LADA', 'ЗЕЛЕНЫЙ', datetime.date(2005, 1, 1), None)]

In [ ]:
%sql select * from lesson

In [ ]:
%sql select *  from teacher

In [32]:
%%sql
-- teacher.*
SELECT teacher.*
FROM lesson
RIGHT JOIN teacher
ON lesson.teacher_id = teacher.id
where lesson.teacher_id is null

 * mysql://root:***@localhost:3306/mysql
4 rows affected.

[(5, 'Вебов', 45000),
 (6, 'Шарпов', 30000),
 (7, 'Шарпов', 40000),
 (8, 'Питошин', 30000)]

In [ ]:
%%sql
SELECT *
FROM teacher
CROSS JOIN lesson;

In [ ]:
%sql select * from users

In [ ]:
%sql select * from clients

In [ ]:

%sql SELECT * FROM users UNION SELECT * FROM clients

In [ ]:
%sql select * from clients where login not in ('Mikle')

In [51]:
%%sql  
select * from Employee

 * mysql://root:***@localhost:3306/mysql
10 rows affected.

[(1001, 'John Doe', 'IT', 35000.0, 'Male', 25, 'London'),
 (1002, 'Mary Smith', 'HR', 45000.0, 'Female', 27, 'London'),
 (1003, 'James Brown', 'Finance', 50000.0, 'Male', 28, 'London'),
 (1004, 'Mike Walker', 'Finance', 50000.0, 'Male', 28, 'London'),
 (1005, 'Linda Jones', 'HR', 75000.0, 'Female', 26, 'London'),
 (1006, 'Anurag Mohanty', 'IT', 35000.0, 'Male', 25, 'Mumbai'),
 (1007, 'Priyanla Dewangan', 'HR', 45000.0, 'Female', 27, 'Mumbai'),
 (1008, 'Sambit Mohanty', 'IT', 50000.0, 'Male', 28, 'Mumbai'),
 (1009, 'Pranaya Kumar', 'IT', 50000.0, 'Male', 28, 'Mumbai'),
 (1010, 'Hina Sharma', 'HR', 75000.0, 'Female', 26, 'Mumbai')]

In [52]:
%sql select * from Projects

 * mysql://root:***@localhost:3306/mysql
8 rows affected.

[(1, 'Develop ecommerse website from scratch', 1, 1003, datetime.datetime(2023, 7, 15, 10, 26, 52), datetime.datetime(2023, 8, 14, 10, 26, 52)),
 (2, 'WordPress website for our company', 1, 1002, datetime.datetime(2023, 7, 15, 10, 26, 52), datetime.datetime(2023, 8, 29, 10, 26, 52)),
 (3, 'Manage our company servers', 2, 1007, datetime.datetime(2023, 7, 15, 10, 26, 52), datetime.datetime(2023, 8, 29, 10, 26, 52)),
 (4, 'Hosting account is not working', 3, 1009, datetime.datetime(2023, 7, 15, 10, 26, 52), datetime.datetime(2023, 7, 22, 10, 26, 52)),
 (5, 'MySQL database from my desktop application', 4, 1010, datetime.datetime(2023, 7, 15, 10, 26, 52), datetime.datetime(2023, 7, 30, 10, 26, 52)),
 (6, 'Develop new WordPress plugin for my business website', 2, None, datetime.datetime(2023, 7, 15, 10, 26, 52), datetime.datetime(2023, 7, 25, 10, 26, 52)),
 (7, 'Migrate web application and database to new server', 2, None, datetime.datetime(2023, 7, 15, 10, 26, 52), datetime.datetime(2023, 7, 20, 10, 26, 52)),
 (8, 'Android Application development', 4, 1004, datetime.datetime(2023, 7, 15, 10, 26, 52), datetime.datetime(2023, 8, 14, 10, 26, 52))]

In [62]:
%%sql  
select * from Employee
where exists (select* from projects where Projects.EmployeeId=Employee.id)

 * mysql://root:***@localhost:3306/mysql
6 rows affected.

[(1003, 'James Brown', 'Finance', 50000.0, 'Male', 28, 'London'),
 (1002, 'Mary Smith', 'HR', 45000.0, 'Female', 27, 'London'),
 (1007, 'Priyanla Dewangan', 'HR', 45000.0, 'Female', 27, 'Mumbai'),
 (1009, 'Pranaya Kumar', 'IT', 50000.0, 'Male', 28, 'Mumbai'),
 (1010, 'Hina Sharma', 'HR', 75000.0, 'Female', 26, 'Mumbai'),
 (1004, 'Mike Walker', 'Finance', 50000.0, 'Male', 28, 'London')]

In [68]:
%%sql  
SELECT EXISTS (SELECT id FROM Employee WHERE id = 1004) AS id_exists;

 * mysql://root:***@localhost:3306/mysql
1 rows affected.

[(1,)]

In [ ]:
%%sql
WITH "average_book_ratings" AS (SELECT "book_id", "title", "year", ROUND(AVG("rating"), 2) AS "rating" FROM "ratings"
JOIN "books" ON "ratings"."book_id" = "books"."id"
GROUP BY "book_id"),
SELECT "year" ROUND(AVG("rating"), 2) AS "rating" FROM "average_book_ratings"
GROUP BY "year";

In [ ]:
# WITH name AS (
# SELECT …
# ),
# SELECT … FROM name;

In [ ]:
# CREATE VIEW name AS
# SELECT …;

In [ ]:
# --Convert to a view
%%sql 
CREATE VIEW "average_book_ratings" AS
SELECT "book_id" AS "id", "title", "year", ROUND(AVG("rating"), 2) AS "rating" FROM "ratings"
JOIN "books" ON "ratings"."book_id" = "books"."id"
GROUP BY "book_id";